import React from 'react';
import './Cards.css';
import CardItem from './CardItem';
import Photo_1 from '../../../Content/photo_1.png'
import Photo_2 from '../../../Content/photo_2.png'
import Photo_3 from '../../../Content/photo_3.png'
import Photo_4 from '../../../Content/photo_4.png'
import Photo_5 from '../../../Content/photo_5.png'
import Photo_6 from '../../../Content/photo_6.png'
function Cards() {
    return (
        <div className='cards'>
            <h1>Наші Проєкти</h1>
            <div className='cards__container'>
                <div className='cards__wrapper'>
                    <ul className='cards__items'>
                        <CardItem
                            src={Photo_1}
                            text='Думаєш, щоб волонтерити потрібні якісь спеціальні навички, якими ти не володієш?
                                    Хочеш допомогти ЗСУ, але не знаєш як?
                                    У нас для тебе є чудова пропозиція - плетіння сіток!'
                            label='Плетіння маскувальних сіток'
                            path='/firstPage'
                        />
                        <CardItem
                            src={Photo_2}
                            text='Люди часто переймаються, що буцімто недостатньо роблять для наближення Перемоги. Долучившись до донорського руху, ви вже ніколи не зможете сказати про себе подібного. Одна донація здатна врятувати три життя — життя трьох фантастичних бійців, завдяки яким ми з вами усе ще живі та здорові.'
                            label='Стати донором крові'
                            path='/secondPage'
                        />
                    </ul>
                    <ul className='cards__items'>
                        <CardItem
                            src={Photo_3}
                            text='Мальтійська Служба Допомоги щороку проводять традиційну акцію допомоги дітям-сиротам, які проживають у інтернатах та дитячих будинках Івано-Франківська та області. Метою акції є приготування подарунків дітям-сиротам до свята Миколая, а також забезпечення їх речима першої необхідності.'
                            label='Акція "Святий Миколай"'
                            path='/thirdPage'
                        />
                        <CardItem
                            src={Photo_4}
                            text='Благодійний фонд «Очі миру» надає вчасну допомогу дітям, що опинились в складних життєвих обставинах, зараз ми зосередились на психосоціальній підтримці дітей, які постраждали від війни.'
                            label='Волонтерство у БФ "Очі Миру"'
                            path='/fourthPage'
                        />
                    </ul>
                    <ul className='cards__items'>
                        <CardItem
                            src={Photo_5}
                            text='«Дім Сірка» - молода організація, що об’єднала волонтерів, які опікуються тваринами міста вже декілька років.
Намагаємося згуртувати небайдужих івано-франківців, які відкритими очима дивляться на суспільні проблеми та
охочі допомогти.'
                            label='Допомога притулку для тварин'
                            path='/fifthPage'
                        />
                        <CardItem
                            src={Photo_6}
                            text='«Поверни́сь живи́м» — український фонд компетентної допомоги армії. Один із найбільших фондів допомоги українським військовим, які воюють на Донбасі, а з початку російського вторгнення в Україну 2022 року — військовим та волонтерам на території ведення активних бойових дій.'
                            label='Допомога українській армії'
                            path='/sixthPage'
                        />
                    </ul>
                </div>
            </div>
        </div>
    );
}
export default Cards;